import React from "react";

import classes from "./HomePageHorizontalScroll.module.css";
import HorizontalScrollComponent from "../HorizontalScrollComponent";
import img1 from "../../files/images/home-page/1.jpg";
import img2 from "../../files/images/home-page/2.jpg";
import img3 from "../../files/images/home-page/3.jpg";
import img4 from "../../files/images/home-page/4.jpg";
import img5 from "../../files/images/home-page/5.jpg";

const context = [
  {
    heading: "خرید و فروش ارز های دیجیتال",
    text: `به راحتی و با اطمینان خاطر ارزهای دیجیتال مورد نظر خود را خریداری یا فروش کنید. در ایزی‌بیت، ما به شما امکان دسترسی به بازار جهانی ارزهای دیجیتال را می‌دهیم. با استفاده از پلتفرم ما، شما می‌توانید به راحتی ارزهای دیجیتال مختلف را خریداری یا فروش کنید. از بیت کوین و اتریوم گرفته تا ارزهای دیجیتال کمتر شناخته شده، ما به شما دسترسی به یک دنیای گسترده از ارزهای دیجیتال می‌دهیم. `,
    img: img1,
  },
  {
    heading: "امکانات سرمایه گذاری",
    text: `در ایزی‌بیت، ما به شما امکانات سرمایه‌گذاری پیشرفته در بازار ارز دیجیتال را ارائه می‌دهیم. با استفاده از این امکانات، شما می‌توانید سرمایه خود را در ارزهای دیجیتال مختلف سرمایه‌گذاری کنید و از سود حاصل از نوسانات قیمت در بازار بهره‌مند شوید.همچنین، ما ابزارهای تجزیه و تحلیل قدرتمندی را برای کمک به شما در تصمیم‌گیری سرمایه‌گذاری ارائه می‌دهیم. `,
    img: img2,
  },
  {
    heading: "نگهداری دارایی دیجیتال",
    text: `در ایزی‌بیت، ما به شما امکان نگهداری امن دارایی‌های دیجیتال خود را در کیف پول دیجیتال ما می‌دهیم. دارایی‌های دیجیتال شما در بلاکچین ثبت و نگهداری می‌شوند.با استفاده از سیستم نگهداری دارایی دیجیتال ما، شما می‌توانید به راحتی دارایی‌های دیجیتال خود را مدیریت کنید.`,
    img: img3,
  },
  {
    heading: "پشتیبانی مشتری",
    text: `در ایزی‌بیت، ما به شما پشتیبانی مشتری بی‌نظیری را ارائه می‌دهیم. ما می‌دانیم که بازار ارز دیجیتال می‌تواند گیج‌کننده باشد، بنابراین تیم پشتیبانی ما همیشه در دسترس است تا به سوالات شما پاسخ دهد.در ایزی‌بیت، ما می‌دانیم که پشتیبانی مشتری یکی از مهم‌ترین جنبه‌های یک سایت صرافی ارز دیجیتال است. بنابراین، ما به شما تعهد می‌دهیم که همیشه در دسترس باشیم تا به شما کمک کنیم.`,
    img: img4,
  },
  {
    heading: "آموزش معامله با ارز های دیجیتال",
    text: `در ایزی‌بیت، ما معتقدیم که آموزش یکی از مهم‌ترین بخش‌های موفقیت در بازار ارز دیجیتال است. بنابراین، ما منابع آموزشی گسترده‌ای را برای کمک به کاربران در فهم بهتر این بازار پیچیده ارائه می‌دهیم. منابع آموزشی ما شامل مقالات آموزشی، راهنماها، ویدیوها و پاسخ به سوالات متداول است.اگر سوالی دارید یا به کمک نیاز دارید، تیم پشتیبانی ما همیشه آماده است تا به شما کمک کند.`,
    img: img5,
  },
];

const HomePageHorizontalSroll = () => {
  return (
    <div className={`${classes["HomePageHorizontalSroll"]}`}>
      <HorizontalScrollComponent>
        {context.map((c, index) => (
          <div className={`${classes["scroll-page"]}`} key={index}>
            <img src={c.img}></img>

            <div className={`${classes["text-container"]}`}>
              <h1>{c.heading}</h1>
              <p>{c.text}</p>
            </div>
          </div>
        ))}
      </HorizontalScrollComponent>
    </div>
  );
};

export default HomePageHorizontalSroll;
