import React from "react";

import classes from "./HomePageHorizontalScroll.module.css";
import HorizontalScrollComponent from "../HorizontalScrollComponent";
import img1 from "../../files/images/home-page/1.jpg";
import img2 from "../../files/images/home-page/2.jpg";
import img3 from "../../files/images/home-page/3.jpg";
import img4 from "../../files/images/home-page/4.jpg";
import img5 from "../../files/images/home-page/5.jpg";

const context = [
  {
    heading: "خرید و فروش ارز های دیجیتال",
    text: `به راحتی و با اطمینان خاطر ارزهای دیجیتال مورد نظر خود را خریداری یا فروش کنید. در ایزی‌بیت، ما به شما امکان دسترسی به بازار جهانی ارزهای دیجیتال را می‌دهیم. با استفاده از پلتفرم ما، شما می‌توانید به راحتی ارزهای دیجیتال مختلف را خریداری یا فروش کنید. از بیت کوین و اتریوم گرفته تا ارزهای دیجیتال کمتر شناخته شده، ما به شما دسترسی به یک دنیای گسترده از ارزهای دیجیتال می‌دهیم. همچنین، با استفاده از ابزارهای تجزیه و تحلیل قدرتمند ما، شما می‌توانید تصمیمات خرید و فروش خود را بر اساس داده‌ها و آمار بگیرید. بپیوندید به ایزی‌بیت و امروز به جامعه رو به رشد ما در بازار ارز دیجیتال بپیوندید.`,
    img: img1,
  },
  {
    heading: "امکانات سرمایه گذاری",
    text: `در ایزی‌بیت، ما به شما امکانات سرمایه‌گذاری پیشرفته در بازار ارز دیجیتال را ارائه می‌دهیم. با استفاده از این امکانات، شما می‌توانید سرمایه خود را در ارزهای دیجیتال مختلف سرمایه‌گذاری کنید و از سود حاصل از نوسانات قیمت در بازار بهره‌مند شوید.
    امکانات سرمایه‌گذاری ما شامل Staking و Lending می‌شود. با استفاده از Staking، شما می‌توانید ارزهای دیجیتال خود را در کیف پول خود نگهداری کنید و در عوض، سودی را کسب کنید. این یک روش ساده و بدون ریسک برای کسب درآمد از ارزهای دیجیتال است.
    اما اگر به دنبال روش‌های سرمایه‌گذاری پیشرفته‌تر هستید، می‌توانید از امکان Lending استفاده کنید. با این روش، شما می‌توانید ارزهای دیجیتال خود را به دیگران قرض دهید و در عوض، به صورت دوره‌ای سود دریافت کنید.
    همچنین، ما ابزارهای تجزیه و تحلیل قدرتمندی را برای کمک به شما در تصمیم‌گیری سرمایه‌گذاری ارائه می‌دهیم. با استفاده از این ابزارها، شما می‌توانید بازار را به طور دقیق تحلیل کنید و بر اساس داده‌ها و آمار، تصمیمات سرمایه‌گذاری خود را بگیرید.
    به یاد داشته باشید که سرمایه‌گذاری در ارز دیجیتال می‌تواند خطرناک باشد و بازار ارز دیجیتال معمولاً نوسانات قیمت زیادی دارد. بنابراین، توصیه می‌شود که قبل از سرمایه‌گذاری، تحقیقات کافی انجام دهید.`,
    img: img2,
  },
  {
    heading: "نگهداری دارایی دیجیتال",
    text: `در ایزی‌بیت، ما به شما امکان نگهداری امن دارایی‌های دیجیتال خود را در کیف پول دیجیتال ما می‌دهیم. دارایی‌های دیجیتال شما در بلاکچین ثبت و نگهداری می‌شوند. هر ورودی در بلاکچین با یک کلید عمومی و خصوصی مرتبط است که می‌توان آن را مانند یک آدرس ایمیل و رمز عبور تولید شده توسط کامپیوتر در نظر گرفت.
    کیف پول‌های ما به شما کمک می‌کنند تا کلیدهای خود را به طور امن نگهداری کنید، بنابراین فقط شما می‌توانید به دارایی‌های دیجیتال خود دسترسی داشته باشید. همچنین، آن‌ها به شما مکان مناسبی را برای مشاهده دارایی‌ها و موقعیت‌های بلاکچین خود ارائه می‌دهند.
    با استفاده از سیستم نگهداری دارایی دیجیتال ما، شما می‌توانید به راحتی دارایی‌های دیجیتال خود را مدیریت کنید. شما می‌توانید دارایی‌های خود را به دیگران ارسال کنید، یا آن‌ها را در کیف پول خود نگهداری کنید.
    به یاد داشته باشید که امنیت دارایی‌های دیجیتال شما بسیار مهم است. بنابراین، ما توصیه می‌کنیم که همیشه از کلید خصوصی خود محافظت کنید و آن را در مکانی امن نگهداری کنید.`,
    img: img3,
  },
  {
    heading: "پشتیبانی مشتری",
    text: `در ایزی‌بیت، ما به شما پشتیبانی مشتری بی‌نظیری را ارائه می‌دهیم. ما می‌دانیم که بازار ارز دیجیتال می‌تواند گیج‌کننده باشد، بنابراین تیم پشتیبانی ما همیشه در دسترس است تا به سوالات شما پاسخ دهد.
    تیم پشتیبانی ما شامل کارشناسان حرفه‌ای است که دارای دانش گسترده در زمینه ارز دیجیتال هستند. آن‌ها می‌توانند به سوالات شما در مورد خرید و فروش ارز دیجیتال، استفاده از امکانات سرمایه‌گذاری ما، مدیریت کیف پول دیجیتال شما و بسیاری از موضوعات دیگر پاسخ دهند.
    ما از چندین روش برای ارائه پشتیبانی استفاده می‌کنیم. شما می‌توانید با تیم پشتیبانی ما از طریق چت زنده، تلفن یا ایمیل تماس بگیرید. همچنین، ما یک مرکز پشتیبانی آنلاین داریم که شامل مقالات آموزشی، راهنماها و پاسخ به سوالات متداول است.
    در ایزی‌بیت، ما می‌دانیم که پشتیبانی مشتری یکی از مهم‌ترین جنبه‌های یک سایت صرافی ارز دیجیتال است. بنابراین، ما به شما تعهد می‌دهیم که همیشه در دسترس باشیم تا به شما کمک کنیم.`,
    img: img4,
  },
  {
    heading: "آموزش معامله با ارز های دیجیتال",
    text: `در ایزی‌بیت، ما معتقدیم که آموزش یکی از مهم‌ترین بخش‌های موفقیت در بازار ارز دیجیتال است. بنابراین، ما منابع آموزشی گسترده‌ای را برای کمک به کاربران در فهم بهتر این بازار پیچیده ارائه می‌دهیم.
    منابع آموزشی ما شامل مقالات آموزشی، راهنماها، ویدیوها و پاسخ به سوالات متداول است. این منابع به شما کمک می‌کنند تا با مفاهیم اصلی ارز دیجیتال، چگونگی خرید و فروش، استراتژی‌های سرمایه‌گذاری و بسیاری از موضوعات دیگر آشنا شوید.
    همچنین، ما یک برنامه آموزشی را ارائه می‌دهیم که به شما کمک می‌کند تا پیشرفت خود را در یادگیری ارز دیجیتال ردیابی کنید. با استفاده از این برنامه، شما می‌توانید مهارت‌های خود را در زمینه ارز دیجیتال ارتقا دهید و به یک تاجر یا سرمایه‌گذار حرفه‌ای تبدیل شوید.
    در نهایت، ما می‌دانیم که بازار ارز دیجیتال می‌تواند گیج‌کننده باشد. بنابراین، ما به شما تعهد می‌دهیم که همیشه در دسترس باشیم تا به شما کمک کنیم. اگر سوالی دارید یا به کمک نیاز دارید، تیم پشتیبانی ما همیشه آماده است تا به شما کمک کند.`,
    img: img5,
  },
];

const HomePageHorizontalSroll = () => {
  return (
    <div className={`${classes["HomePageHorizontalSroll"]}`}>
      <HorizontalScrollComponent>
        {context.map((c, index) => (
          <div className={`${classes["scroll-page"]}`} key={index}>
            <img src={c.img}></img>

            <div className={`${classes["text-container"]}`}>
              <h1>{c.heading}</h1>
              <p>{c.text}</p>
            </div>
          </div>
        ))}
      </HorizontalScrollComponent>
    </div>
  );
};

export default HomePageHorizontalSroll;
